/* 
   EngineErrorMessages.strings
   WzEngine
 */

"WZAERR_USER_ABORT" = "User abort" ;
"WZAERR_BAD_OPTION" = "Bad options for operation." ;
"WZAERR_UNABLE_TO_OPEN_FOR_OUTPUT" = "Unable to create output file." ;


/*
 *   LHA errors
 */

"WZAERR_LHA_ERROR_BAD_ARCHIVE" = "LHA archive has invalid/damaged content"; 
"WZAERR_LHA_ERROR_LIB_CANT_UPDATE_ARCHIVE" = "Unable to update archive." ;
"WZAERR_LHA_ERROR_LIB_NOTHING_DONE" = "Error: no files found; nothing to do.";
"WZAERR_LHA_ERROR_HEADER_INVALID_LHARC_HEADER" = "Invalid LHA archive header.";
"WZAERR_LHA_CANT_MAKE_DIRECTORY" = "Unable to create folder.";


/*
 * RAR errors
 */
 
"WZAERR_RAR_MISSING_PASSWORD" = "Missing password.";
"WZERR_RAR_CRC_ERROR" = "CRC mismatch in file - possible wrong/missing password";
"WZERR_RAR_ECREATE" = "Unable to create output file/folder.";
"WZAERR_BAD_PASSWORD" = "Bad data in file - possible wrong/missing password";

/*
 * 7z errors
 */
 
"WZAERR_7Z_EXTRACT_FAILURE" = "Unable to extract file(s). Possibly incorrect password supplied." ;


"WZ_OPEN_FILE_FAILED" = "Unable to open this file.";
